// task 1

function myName() {
    // აქ ვქმნით ფუნქციას სახელად myName
    console.log("David Adeishvili");
    // აქ ვბეჭდავთ ჩემს სახელსა და გვარს
}

 myName()

// აქ ვიძახებთ ამ ფუნქციას



// task 2

document.getElementById("button1")
// აქ გადმოგვაქვს ელემენტი
button1.onclick = function hello() {
    // აქ ვწერტ რომ დაჭერისას გამოვიდეს ფუნქცია
    alert("Davit Adeishvili");
    // ვწერ რა იგულისხმება ფუნქციაში
}

hello()
// ვიძახებთ ფუნქციას


// ჯს-ს ფუნქციაში უბრალოდ ვწერთ function=ს მერე სახელს ფრჩხილებს ვხსნით კლაკნილ ბრჭაყლს და ვიწყებთ შგნით წერას
// პითონში ვიყენებთ : --- ამას ხოლო ჯს-ში {}--- ამას