// გამოიყენეთ ყველა შესწავლილი Math ობიექტის მეთოდი და გააკეთეთ თითო თითო მაგალითი

console.log (Math.round(4.9))
// ამრგვალებს რიცხვს უახლოეს ინტეჯერამდე
console.log (Math.ceil(29.999))
// ამრგვალებს ფლოუთს უახლოეს უდიდეს მთელ რიცხვამდე
console.log (Math.floor(91922.001))
// ამრგვალებს ფლოუთს უმცირეს ინტეჯერამდე
console.log (Math.trunc(9173.0281))
// შლის . --- ის მერე რიცხვებს და აბრუნებს ინბტეჯერს
console.log (Math.PI())
// აბრუნებს მათემატიკურ პის
console.log (Math.pow(19290.017, 0.027))
// პირველ რიცხვს აბრუნებს მეორე რიცხვის ხარისხში
console.log (Math.abs(19, -19))
// აბრუნებს დადებით აბსოლუტურ რიცხვს
console.log (Math.sqrt(19))
// ააკვადრატებს რაიმე რიცხვს
console.log (Math.E(19))
// ეულერის რიცხვს აბრუნებს
console.log (Math.random())
// შემთხვევითად აბრუნებს რაიმე ფოუთს 0-1